{
   "navItems": [
    {
      "label": "About Me",
      "href": "/"
    },
    {
      "label": "Projects",
      "href": "/projects"
    }
  ],
   "projects":{
        "title": "My Projects",
        "description": " Here are some of the projects I've worked on. Feel free to explore and check out the code on GitHub!",
        "correDescription": "As a volunteer, I developed the responsive landing page for \"Corre com o Coração\" an NGO dedicated to preventing undiagnosed heart conditions in young athletes.\n\nUsing Next.js and TailwindCSS, I built a high-performance, accessible web application deployed on Vercel. I also led the SEO strategy to maximize the organization's visibility, directly supporting their mission to save lives through awareness and early diagnosis.",
        "learnPhysicsDescription": "Learn-Physics project description here.",
        "wbdDescription": "During my fourth semester at the Experimental Software Engineering Agency (AGES), I developed the \"WBD+ Social Impact Monitoring\" platform for the non-profit WimBelemDon. This responsive web application streamlines workshop management and generates strategic impact reports to aid in transparency and fundraising.\n\n The project utilizes a robust technology stack featuring a React frontend for dynamic interaction and a modular NestJS (TypeScript) backend. This architecture was specifically chosen to ensure scalability, testability, and high performance via the Node.js ecosystem, effectively bridging academic development with real-world social impact.",
        "luckyDrawDescription": "During my third semester, I developed \"Lucky Draw\" within the Experimental Software Engineering Agency (AGES), an immersive academic course designed to simulate a professional software environment. The app addresses creative block by gamifying the artistic process with random, tarot-inspired drawing themes.\n\n As a Fullstack developer, We built the mobile interface using React Native and a robust API with Java Spring Boot and PostgreSQL, utilizing Docker for environment orchestration. This project was pivotal in refining my technical skills and collaborative abilities in a team setting."
    },
    "aboutMe": {
        "fullstack": "Full-Stack Developer",
        "pt2": "focused on shipping reliable code.",
        "pt3": "As a Software Engineering student - PUCRS, I combine a strong foundation in algorithms with practical expertise in React, Java and Typescript. ",
        "pt4": "My experience spans the full development lifecycle, from conceptualizing ideas in collaborative environments to deploying scalable applications.",
        "pt5": "I am seeking an opportunity to join a dynamic team where I can leverage my proactive attitude and full-stack capabilities to deliver high-quality software."
    }
}