{
   "navItems": [
    {
      "label": "Sobre Mim",
      "href": "/"
    },
    {
      "label": "Projetos",
      "href": "/projects"
    }
  ],
   "projects":{
        "title": "Meus Projetos",
        "description": "Aqui estão alguns dos projetos em que trabalhei. Sinta-se à vontade para explorar e conferir o código no GitHub!",
        "correDescription": "Como voluntário, desenvolvi a landing page responsiva para o \"Corre com o Coração\", uma ONG dedicada à prevenção de condições cardíacas não diagnosticadas em jovens atletas.\n\nUtilizando Next.js e TailwindCSS, construí uma aplicação web de alto desempenho e acessível, implantada na Vercel. Também liderei a estratégia de SEO para maximizar a visibilidade da organização, apoiando diretamente sua missão de salvar vidas através da conscientização e diagnóstico precoce.",
        "learnPhysicsDescription": "Dashboards interativos e visualizações para facilitar o aprendizado de física. O Learn-Physics é uma plataforma educacional que oferece recursos dinâmicos para estudantes explorarem conceitos de física através de simulações e exercícios práticos. \n\nEm construção...",
        "wbdDescription": "Durante meu quarto semestre na Agência Experimental de Engenharia de Software (AGES), desenvolvi a plataforma \"WBD+ Monitoramento de Impacto Social\" para a WimBelemDon. O sistema integra banco de dados para registro contínuo de presença e avaliações dos educandos, com dashboard e relatórios personalizados que apoiam a gestão pedagógica e institucional por meio de indicadores quantitativos e qualitativos.\n\nA solução utiliza React no frontend e NestJS no backend, garantindo escalabilidade e desempenho, e conecta o desenvolvimento acadêmico ao impacto social real.",
        "luckyDrawDescription": "Durante meu terceiro semestre, desenvolvi o \"Lucky Draw\" na Agência Experimental de Engenharia de Software (AGES), uma disciplina acadêmico imersiva projetada para simular um ambiente profissional de software. O aplicativo aborda o bloqueio criativo gamificando o processo artístico com temas de desenho aleatórios inspirados em tarô.\n\nComo desenvolvedor Fullstack, construímos a interface mobile usando React Native e uma API robusta com Java Spring Boot e PostgreSQL, utilizando Docker para orquestração de ambiente. Este projeto foi fundamental para refinar minhas habilidades técnicas e capacidades colaborativas em um ambiente de equipe."
    },
    "aboutMe": {
        "fullstack": "Desenvolvedor Full-Stack",
        "pt2": "focado em entregar código confiável.",
        "pt3": "Como estudante de Engenharia de Software na PUC-RS, combino uma sólida base em algoritmos com experiência prática em React, Java e Typescript.",
        "pt4": "Minha experiência abrange todo o ciclo de desenvolvimento, desde a conceituação de ideias em ambientes colaborativos até a implantação de aplicações escaláveis.",
        "pt5": "Estou buscando uma oportunidade para me juntar a uma equipe dinâmica onde possa aproveitar minha atitude proativa e capacidades full-stack para entregar software de alta qualidade."
    },
    "educationTitle": "Linha do Tempo",
    "education1": {
        "degree": "Ensino Médio",
        "institution": "Colégio Mãe de Deus",
        "period": "Fevereiro 2021 - Dezembro 2023"
    },
    "education2": {
        "degree": "Bacharelado em Engenharia de Software",
        "institution": "Pontifícia Universidade Católica do Rio Grande do Sul \n(PUC-RS)",
        "period": "Março 2024 - Presente"
    },
    "education3": {
        "degree": "1º projeto em equipe desenvolvido - Lucky Draw",
        "institution": "PUC-RS - AGES",
        "period": "Março 2025 - Julho 2025"
    },
    "education4": {
        "degree": "1º participação em Hackathons",
        "institution": "Organizado pela PUC-RS",
        "period": "Junho 2025"
    },
    "education5": {
        "degree": "Apple Developer Academy: Foundations",
        "institution": "PUC-RS, Apple e Instituto Eldorado",
        "period": "Agosto 2025 - Setembro 2025"  
    }
}